<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Question;

class QuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $questions = [
            [
                'question' => 'شو الدول التي تفضل أن تقيم الأردن علاقات سياسية متينة معها من الدول الكبرى؟',
                'option1' => 'الولايات المتحدة',
                'option2' => 'روسيا والصين',
                'option3' => 'المهم مصلحة الأردن ووضعها السياسي الدولي',
            ],
            [
                'question' => 'هل للحكومة الحق أن تتدخل في الاقتصاد وكيفية توزيع الثروات بين الأفراد؟',
                'option1' => 'أكيد، وأن يتم توزيعها بين أفراد المجتمع بالتساوي وتسمح للطبقة العامة بالسيطرة على الزراعة والصناعة حتى نقلل من البرجوازية.',
                'option2' => 'لا، تدخل الحكومة في الاقتصاد يعني توزيع عادل للثروات يؤدي الى المساواة بين طبقات المجتمع، وأنا بدعم وجود الطبقية المجتمعية واختلافات وتميز فردي لذا لا اتفق.',
                'option3' => 'أنا مع السوق الحرة والتفرد الاقتصادي ولكن بتنظيم من الحكومة.',
            ],
            [
                'question' => 'أي من الآتي الأقرب لوجهة نظرك عن النظام الضريبي؟',
                'option1' => 'أنا مع العدالة، وأؤيد فرض الدولة الضرائب على الأثرياء بما يساهم بتحقيق التكافل المجتمعي ودعم الخدمات الاجتماعية.',
                'option2' => 'أنا مع تخفيف الضرائب وأن يكون هنالك فرص للتميز بين أفراد المجتمع، بالعكس هيك بنحفز أبناء الوطن على الابتكار والريادة والنمو الاقتصادي.',
                'option3' => 'أنا مع وجود نظام ضريبي يدعم العدالة والمساواة المجتمعية وبنفس الوقت تحفيز نمو الاقتصاد والتفرد والتميز بين المواطنين.',
            ],
            [
                'question' => 'هل تعتقد أن الحكومة مسؤولة عن تقديم رعاية صحية وتعليم مجاني وضمان اجتماعي للمواطنين؟',
                'option1' => 'أكيد أنا مع توسع دور الحكومة في برامج الاستحقاق مثل التعليم المجاني والضمان الاجتماعي والرعاية الصحية وغيرها.',
                'option2' => 'لا أعتقد، أنا مع أن تكون هذه الخدمات مدفوعة وهذا رح يساهم بتفاوت الجودة حسب طبقات المجتمع.',
                'option3' => 'برأيي بعض منها يجب توفيره من قبل القطاع الحكومي والبعض الآخر يوفره القطاع الخاص.',
            ],
            [
                'question' => 'شو رأيك بخصوص اللاجئين في الأردن؟',
                'option1' => 'مرحب فيهم طبعًا، ظروف بلادهم ووطنهم صعبة لذا بشوف أن يتم تقديم الرعاية والمساعدة لهم من كافة القطاعات.',
                'option2' => 'وجود اللاجئين بيشكل تهديد على مصلحة أبناء الوطن وبيزيد البطالة والاكتظاظ السكاني، أنا ضد استضافة اللاجئين ولازم الدولة تتبع قيود صارمة معهم.',
                'option3' => 'أنا بتفهم ظروف اللاجئين وكذلك بتهمني مصلحة البلد، بشوف لازم يكون في خطط مدروسة لاستقبالهم.',
            ],
            [
                'question' => 'هل حماية البيئة أهم من تنمية الاقتصاد؟',
                'option1' => 'أكيد حماية البيئة أولوية، حتى لو قلل النمو الاقتصادي مؤقتًا، لأن استدامة الحياة والاقتصاد تعتمد على الحفاظ على الموارد الطبيعية.',
                'option2' => 'النمو الاقتصادي يجب أن يكون الأولوية، حتى لو أثر ذلك على البيئة، فالتقدم الاقتصادي يخلق فرص عمل، يعزز رفاهية الأفراد، ويساعد في تحسين مستوى الحياة.',
                'option3' => 'أنا مع التوازن بين القطاعين، حماية البيئة مهمة بقدر نمو الاقتصاد.',
            ],
            [
                'question' => 'هل انت مع الحفاظ على القيم المجتمعية التقليدية والبيئة المحافظة؟',
                'option1' => 'طبعًا، ويجب تقديمها على الحريات الشخصية الفردية والأقليات سواء دينية أو جنسية أو فكرية وغيرها.',
                'option2' => 'أنا ضد، لازم نحترم الاختلاف والتعدد بينا ويتوجب على الدولة حماية الأقليات والحريات الفردية.',
                'option3' => 'أنا مع حماية الحريات الشخصية بما يتناسب مع التقاليد المجتمعية المحافظة.',
            ],
            [
                'question' => 'شو رأيك بربط الدين بالسياسة والتشريعات؟',
                'option1' => 'أنا مع فصل الدين تمامًا عن السياسة وعدم فرضه على الجميع.',
                'option2' => 'الدين لازم يكون له دور بارز في وضع وتوجيه السياسة والقوانين والتشريعات.',
                'option3' => 'أنا مع وجود القيم الدينية في القوانين لكن ضد هيمنتها وسيطرتها على القرار السياسي.',
            ],
            [
                'question' => 'شو موقفك تجاه الطلاق وحقوق المرأة بعده في إطار قوانين الأحوال الشخصية؟',
                'option1' => 'أنا بدعم حق الرجل في الطلاق بسهولة وفقًا للشريعة الإسلامية وأؤيد حق المرأة في الخلع بشروط محددة.',
                'option2' => 'أنا مع المساواة الكاملة بين الرجل والمرأة في الطلاق، وأؤيد حقوق المرأة في الحصول على الطلاق بسهولة دون قيود.',
                'option3' => 'أنا مع التوازن بين حقوق الرجل والمرأة في الطلاق، مع التأكيد على الحفاظ على استقرار الأسرة وفرض بعض الضوابط على الطلاق التعسفي.',
            ],
            [
                'question' => 'شو موقفك العام تجاه العنف ضد الأطفال وأساليب التربية الحديثة وقوانين حماية الطفل؟',
                'option1' => 'أنا أدعم قوانين حماية الطفل من العنف، مع التركيز على دور الأسرة في التربية، وأرفض الأساليب التربوية الغربية التي تتعارض مع القيم الدينية.',
                'option2' => 'أنا أدعم القوانين الصارمة لحماية الأطفال من العنف بجميع أشكاله، ومهتم بالتربية الحديثة التي تركز على التعليم غير العنيف والتواصل الفعال.',
                'option3' => 'أنا أكيد بدعم حماية الطفل من العنف مع التأكيد على دور الأسرة التقليدية في التربية.',
            ],
        ];

        foreach ($questions as $data) {
            Question::create($data);
        }
    }
}
